# KipDashFtPerDegreePerFt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KipDashFtPerDegreePerFt Property
SymbolTypeId Class See Also
---
Symbol kip-ft/°/ft, indicating unit Kip feet per degree per foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipDashFtPerDegreePerFt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipDashFtPerDegreePerFt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipDashFtPerDegreePerFt {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace